{
  "url": "https://theintercept.com/2025/06/24/zohran-mamdani-andrew-cuomo-nyc-mayor/",
  "platform": "theintercept.com",
  "is_social_media": false,
  "scraped_at": "2025-06-27T10:24:45.971485",
  "title": "How Andrew Cuomo Could Become NYC Mayor — Even if Zohran Mamdani Wins",
  "text": "NYC mayoral candidate Zohran Mamdani campaigns in Jackson Heights, Queens, on June 21, 2025. Photo: Andrew Lichtenstein/Corbis via Getty Images “New York Is Not a democracy,” read a headline from The Atlantic earlier this month lamenting the city’s ranked-choice voting system ahead of the upcoming mayoral primary election. The statement rankled some observers, but it was largely true — just not because of ranked-choice voting. A well-financed political machine is gearing up to topple New York Assembly Member Zohran Mamdani even if he beats former Gov. Andrew Cuomo in Tuesday’s Democratic primary for mayor. While Cuomo is heavily favored to win the election, a Mamdani victory appears closer than ever: The democratic socialist leads Cuomo in one of the latest polls ahead of the June 24 election. While the outcome would be a major accomplishment for New York City’s progressives and socialists, it would be far from the end of the road. Even if Cuomo loses on Tuesday — despite the $24.9 million the city’s billionaires, real estate tycoons, and former leaders have poured into a super PAC backing him — the disgraced former governor, like current New York City Mayor Eric Adams, plans to run in the general election on a third-party ballot line . Related Buffalo’s Developer Class Backing Last-Ditch Attempt Against Socialist India Walton That possibility sounds eerily familiar to those who watched what happened in Buffalo four years ago to socialist India Walton , who beat four-term incumbent Byron Brown in the city’s 2021 Democratic primary for mayor. Rather than concede, Brown ran a last-minute campaign backed by Republicans and real estate developers to get a ballot line and win the general election. He served as mayor until last year. “If Mamdani was to win the Democratic Party primary for mayor, New York City will probably repeat something similar to what happened in heavily Democratic Buffalo in 2021,” said John Kaehny of Reinvent Albany, a statewide watchdog group. “Deep-pocketed business interests and the Democratic Party incumbency was shocked by Walton’s win and poured money and support into Brown’s winning general election campaign.” The pool of money for an independent Cuomo campaign is indeed deep. Billionaire Israel fanatic Bill Ackman, hedge fund manager Daniel Loeb , and former New York City Mayor Michael Bloomberg have poured $9.1 million into Fix the City, making up more than a third of the funding for the Cuomo-backing PAC. Many of Cuomo’s deep-pocketed supporters seem to feel particular political ire for Mamdani over his criticism of Israel’s genocide in Gaza, triggering an entire news cycle about Mamdani’s thoughts on the protest cry “globalize the intifada.” Neither the Mamdani nor Cuomo campaigns immediately responded to requests for comment. Mamdani, who if elected would be the city’s first Muslim mayor, has been the target of Islamophobic harassment and bomb threats during the campaign. His success on Tuesday would almost certainly guarantee a bigger and stronger backlash from his political opponents in the general election. “Everyone is very laser-focused on tomorrow. But I think that everyone knows that even if we win tomorrow, the fight’s not over until November,” said state Sen. Jabari Brisport, who spoke to The Intercept on the way to a canvassing shift for Mamdani on Monday evening. Brisport, another socialist state legislator, endorsed Mamdani in March. Still, Mamdani supporters have something that Walton’s campaign didn’t, Brisport said. “I don’t think anybody on India Walton’s campaign expected that Byron Brown would launch a write-in campaign,” Brisport said. “Whereas we’ve known for some time that Andrew Cuomo was running in the general election, regardless of what happens.” Most Read N.Y. Dems Face Choice Between Voters’ Chosen Candidate and Disgraced Adams, Cuomo Maia Hibbett Northwestern Students Face Criminal Charges for Pro-Palestine College Newspaper Parody Connor Echols Trump’s Global Gulag Search Expands to 53 Nations Nick Turse According to Jasmine Gripper, co-director of the New York State Working Families Party, Mamdani’s campaign infrastructure far exceeds Walton’s. “I think he’s redefining what’s possible in a large city,” she said. “And the apparatus is ready to engage and level up if they go into a general election.” She said her party views Tuesday’s contest as the first big race since President Donald Trump won in 2024. If Mamdani loses, there’s a possibility that he could run on the Working Families Party line in the general election — though Gripper said the New York WFP has not decided whether they’ll run a candidate on their line in the general election and will make a decision after the final primary results come in. At that point, the groups backing Mamdani will take stock of the results, said Daniel Coates, political director at Make the Road Action, which endorsed Mamdani after New York City Comptroller Brad Lander. “I don’t think anything is off the table in terms of strategies and actions that the Cuomo camp will play,” Coates said. Related Cuomo’s “Women’s Equality Party” Might Just Be the Most Cynical Political Move of His Career “On the one hand, it’s scary and it’s true that Bill Ackman and DoorDash and organizations and companies that just want to have a mayor that just does their bidding — you could see them dropping a lot of money, and Cuomo’s already put his ballot line together,” he added. “But sometimes the weight of your own money can weigh you down. I don’t think voters like the idea of buying an election.” Kaehny pointed to Bloomberg, Cuomo’s single largest donor. “Cuomo’s super wealthy contributors have signaled they will spend what it takes to defeat Mamdani in a general election rematch,” he said. “Like other Americans, New Yorkers can thank the Supreme Court’s Citizens United decision for opening the floodgates of unlimited political spending and obliterating any concept of fairness in American democracy.” Billionaires are used to having a mayor and politicians who work for them, said Gustavo Gordillo, co-chair of NYC Democratic Socialists of America. “We’re expecting them to fight us all the way. If he wins the primary, we’re not gonna rest or let up. We’re going to keep the fight on until the general. And if he wins the general, then we’re going to keep organizing and keep the struggle going well into his administration because that’s the only way that we can actually implement the agenda and change our politics.” Unless one candidate receives more than 50 percent of the vote on Tuesday, New Yorkers won’t know who won the Democratic primary for a week: The New York City Board of Elections will need to run its ranked-choice voting algorithm, and that process is scheduled for July 1 . We’re independent of corporate interests — and powered by members. Join us. Become a member Join Our Newsletter Thank You For Joining! Original reporting. Fearless journalism. Delivered to you. Will you take the next step to support our independent journalism by becoming a member of The Intercept? I'm in Become a member By signing up, I agree to receive emails from The Intercept and to the Privacy Policy and Terms of Use . Join Our Newsletter Original reporting. Fearless journalism. Delivered to you. I'm in If Mamdani makes it to the general election, centrists could potentially split four ways in the general between Cuomo, Adams, independent attorney Jim Walden, and Republican Guardian Angels founder Curtis Sliwa. “The political establishment has totally failed the city,” Gordillo said. “Even though we expect a big onslaught of money spent against our movement, I think the fact that they have had no answers to the people of the city, that they’ve really failed to campaign on anything other than fear and the same old business, we’ll be able to defeat them.” Democrats have spent more time fighting progressives on the left than on fighting Republicans, according to Gripper. But that’s not new. “A victory by Zohran in the Democratic primary would be a seismic shift in politics and the election and how campaigns are run and won. Not just in New York City but across the nation,” she said. “Even though it’s the mayor, it’s not really a local position. It’s a national position,” Gripper said. “We know that if Zohran wins, it will create a new narrative around what’s possible.” Share Copy link Share on Facebook Share on Bluesky Share on X Share on LinkedIn Share on WhatsApp IT’S EVEN WORSE THAN WE THOUGHT. What we’re seeing right now from Donald Trump is a full-on authoritarian takeover of the U.S. government. This is not hyperbole. Court orders are being ignored. MAGA loyalists have been put in charge of the military and federal law enforcement agencies. The Department of Government Efficiency has stripped Congress of its power of the purse. News outlets that challenge Trump have been banished or put under investigation. Yet far too many are still covering Trump’s assault on democracy like politics as usual, with flattering headlines describing Trump as “unconventional,” “testing the boundaries,” and “aggressively flexing power.” The Intercept has long covered authoritarian governments, billionaire oligarchs, and backsliding democracies around the world. We understand the challenge we face in Trump and the vital importance of press freedom in defending democracy. We’re independent of corporate interests. Will you help us? $15 $25 $50 $100 $5 $8 $10 $15 One Time Monthly Donate Contact the author: Akela Lacy akela.lacy@theintercept.com @akela_lacy on X Related Down Two Squad Members, Progressives Come for an AIPAC Democrat Small-Dollar Donors Are Asking John Fetterman for Their Money Back Trump Donors Try to Buy Pittsburgh Mayor’s Race Primaries Matter: Why This Time Is Different for Andrew Cuomo Latest Stories Voices Zohran Can Happen Anywhere (But Having an Opponent Like Cuomo Helps) Susan Kang - June 26 Mamdani’s mayoral campaign shows a successful playbook for the left — but years of history united NYC progressives against Andrew Cuomo. The End of Roe South Carolina Can Deny Medicaid Patients Planned Parenthood Care, SCOTUS Rules Jessica Washington - June 26 In a 6 to 3 decision, the Supreme Court allowed South Carolina to bar over 1 million people from accessing health care. War Powers Resolution From House Democratic Leaders May Not Limit Trump’s War Powers Matt Sledge - June 25 In an apparent nod to Israel, some Democrats want to give Trump power to defend “an ally or partner of the United States from imminent attack.” Join The Conversation",
  "author": "",
  "publisher": "The Intercept",
  "published_date": "2025-06-24T10:00:00+00:00",
  "site_name": "theintercept.com"
}